[{"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_0.jpg", "transcript": "The image has a black background. Centered on the image is the text \"THE ART OF DESIGN\" in white. \"THE ART OF\" is stacked on top of \"DESIGN\".", "video_segment_id": 0, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_1.jpg", "transcript": "The image is a white background with black text. The text reads \"THE ART OF QUALITY\" with \"THE ART OF\" in a smaller font above the word \"QUALITY\", which is in a larger, bold font.", "video_segment_id": 1, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_2.jpg", "transcript": "The image is a black background with white text. The text reads \"THE ART OF\" in a smaller font size above the word \"TAILORING\" which is in a much larger font size.", "video_segment_id": 2, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_3.jpg", "transcript": "The image shows a high-angle, slightly distorted view of many rolls of what appears to be fabric. The rolls are primarily dark blue or black, and they are tightly packed together. The center of each roll has a visible cardboard core, which appears as a tan or light brown circle. The overall effect is a pattern of dark cylinders with light circles, creating a visually complex and textured composition. The rolls are slightly blurred, giving the image a sense of depth.", "video_segment_id": 3, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_4.jpg", "transcript": "The image is a dark, abstract shot with a blurry, light gray shape dominating the left side of the frame. The background is a deep blue, and there are faint, linear patterns that appear to be architectural or technical drawings. The text \"Selected stores. Design development.\" is at the bottom of the image. The overall impression is one of mystery and technological design.", "video_segment_id": 4, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_5.jpg", "transcript": "The image shows a dark, somewhat abstract scene. The overall tone is cool and blue, creating a mysterious and somewhat industrial ambiance. There are many small, bright particles or droplets scattered throughout the image, which appear to be moving, suggesting a dynamic environment.\n\nAt the bottom, there's a sharp, angled edge with a slightly blurred or out-of-focus appearance. This could be a surface or a structure of some kind, possibly metallic or reflective, as it seems to catch the light.\n\nText is present at the bottom of the image, reading \"Selected stores. Design development.\" This implies that the image is related to retail or design, possibly as part of an advertisement or presentation.", "video_segment_id": 5, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_6.jpg", "transcript": "The image shows a close-up of a white measuring tape, partially coiled. The numbers \"88,\" \"89,\" and \"90\" are visible on the tape. The background is dark and blurry, with a blueish tint. At the bottom of the image, there is text that reads \"Selected stores. Design development.\"", "video_segment_id": 6, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_7.jpg", "transcript": "The image appears to show the inner workings of a clock or watch mechanism. There are several thin, metallic rods or needles extending from a central, circular structure. The rods have a shiny, reflective surface. The central structure is gold in color. The background is dark and out of focus, with hints of blue and brown. The overall impression is one of intricate detail and mechanical precision.", "video_segment_id": 7, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_8.jpg", "transcript": "The image is a mirrored composition featuring what appears to be the bottom of a steam iron. The iron's soleplate, with its numerous steam holes, is visible on the left and right sides of the image, symmetrically arranged. Steam is forcefully emanating from the holes, creating a misty, cloud-like effect that converges towards the center of the image. The background is dark, which accentuates the bright, ethereal quality of the steam. The overall effect is abstract and almost otherworldly, transforming a mundane object into a dynamic visual display.", "video_segment_id": 8, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_9.jpg", "transcript": "The image shows a close-up of a garment label sewn into a piece of fabric. The label is rectangular and light gray or off-white in color. It features the \"Woolmark\" logo on the left, which consists of three interwoven strands that form a circular shape. To the right of the logo, the words \"PURE NEW WOOL\" are printed in a simple, sans-serif font. The fabric behind the label appears to be a shiny, satin-like material in a shade of lavender or light purple. The fabric has a smooth, reflective surface with subtle folds and creases that create variations in light and shadow. The overall composition is focused and detailed, highlighting the texture of both the label and the fabric it is attached to.", "video_segment_id": 9, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_10.jpg", "transcript": "The image shows a wooden chair with a dark piece of clothing draped over it. The chair is positioned in the center of the frame and has a simple design with four legs, a seat, and a backrest. The clothing appears to be in motion, slightly blurred, suggesting it may have been tossed onto the chair. The background is a neutral, light gray color, providing a clean and minimalist setting that emphasizes the chair and clothing. The lighting creates a shadow cast by the chair onto the floor, adding depth to the composition.", "video_segment_id": 10, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_11.jpg", "transcript": "The image shows a hand holding a dark blue blazer. The blazer appears to be partially on a person, as a hint of a light purple garment can be seen underneath. The background is a plain, dark grey color. The hand is fair-skinned and wearing a watch. The overall lighting is soft and even, highlighting the texture of the blazer.", "video_segment_id": 11, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_12.jpg", "transcript": "The image is a black background with the text \"MODERN BRITISH TAILORING\" in white, centered horizontally and vertically.", "video_segment_id": 12, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_13.jpg", "transcript": "The image shows a man standing in a studio setting. He is wearing a dark blue suit with a light-colored shirt and tie. He has a beard and dark curly hair. He is standing with his eyes closed and his head tilted slightly back, as if he is enjoying a moment of peace. His hands are at his chest, adjusting his suit. To his left, there is a simple wooden chair. The background is a solid gray color.", "video_segment_id": 13, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_14.jpg", "transcript": "The image shows a well-dressed man in a navy blue suit, vest, and patterned tie against a dark gray backdrop. The man has dark, curly hair and a neatly trimmed beard. He is looking slightly down and to the side with a confident expression. His left hand is touching the button of his vest, while his right hand is not visible. A neatly folded pocket square is visible in the breast pocket of the suit jacket. The lighting is focused on the man, highlighting the details of his suit and features.", "video_segment_id": 14, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_15.jpg", "transcript": "The image shows a woman with dark hair, styled back and slightly wet-looking, wearing a dark suit with a white collared shirt and a blue patterned tie. She is sitting on a wooden beam or ledge. Her expression is somewhat knowing or sly, and she has one hand slightly raised as if in a gesture. The background is a solid gray color, which creates a stark contrast with the dark suit and draws attention to the woman. The lighting is soft and even, giving the image a clean and professional feel.", "video_segment_id": 15, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_16.jpg", "transcript": "The image features a surreal scene with a man and a woman in business attire interacting with chairs of dramatically different sizes. The man is standing next to a normal-sized wooden chair, while the woman is sitting on an enormous wooden chair. The background is a plain, neutral gray, which emphasizes the unusual scale of the objects and figures in the foreground. The lighting is soft and diffused, creating long shadows that stretch across the floor, adding to the dreamlike quality of the image. The overall composition suggests a commentary on power dynamics or perspective.", "video_segment_id": 16, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_17.jpg", "transcript": "The image is a dark, almost black, background with the text \"BESPOKE TO US\" centered in the frame. The text is in a light color, likely white or a light gray, which contrasts with the dark background, making it easily readable.", "video_segment_id": 17, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_18.jpg", "transcript": "The image is a dark, almost black background with the words \"BESPOKE TO US\" written in white, centered horizontally and vertically.", "video_segment_id": 18, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}, {"extracted_frame_path": "./shared_data/videos/video3\\extracted_frame\\frame_19.jpg", "transcript": "The image is a simple, minimalist design against a black background. At the center, stacked on top of each other, are the words \"ONLY\" and \"M&S\" in a clean, sans-serif font. Below that, in smaller text, it reads \"ONLINE | MOBILE | IN STORE\". All text is white.", "video_segment_id": 19, "video_path": "./shared_data/videos/video3\\M&S Men's Style The Art of Tailoring - TV AD 2016.mp4"}]