[
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_0.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:**\n\nThe image appears to be a low-angle shot taken on a city street. It features a woman prominently in the foreground, with a backdrop of buildings and street furniture. The color palette leans towards muted greens and whites, creating a somewhat urban and potentially vintage aesthetic.\n\n**Objects:**\n\n*   **Traffic Light:** A traffic light is visible near the woman, with a green light showing.\n*   **Lamp Post:** A lamp post with a spherical light fixture is seen on the left side of the frame.\n*   **Building:** A large building with multiple windows and architectural details forms the background.\n\n**People:**\n\n*   **Woman:** The main subject is a woman with short, dark hair. She is wearing a green and white striped blazer over a white top. She has an ear cuff on her left ear.\n\n**Text:**\n\n*   There is no visible",
        "video_segment_id": 0,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_1.jpg",
        "transcript": "Here's a breakdown of the visual elements in the image:\n\n**Overall Impression:** The image has a slightly vintage or film-like quality due to the border and color grading. The focus is on a woman in a stylish outfit, posing in a park-like setting. The lighting is soft and diffused.\n\n**People:**\n\n*   **Woman:** A young woman is the central figure. She has dark hair pulled back, fair skin, and is wearing noticeable earrings. Her expression is serious and direct, looking straight at the camera.\n\n**Clothing:**\n\n*   **White Blouse:** The woman is wearing a long-sleeved white blouse with a bow at the neck.\n*   **Black Corset/Harness:** Over the blouse, she's wearing a black corset or harness-like garment that cinches at the waist. It has visible straps and details.\n*   **Black Skirt:** She is wearing a form-fitting black skirt that appears",
        "video_segment_id": 1,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_2.jpg",
        "transcript": "Here is a detailed description of the visual elements in the image:\n\n**Overall Impression:** The image has a vintage or film-like aesthetic with a slightly desaturated color palette and soft lighting. It appears to be a still from a video, likely a fashion or artistic piece.\n\n**Main Subject:**\n*   **Person:** A young woman stands prominently in the center of the frame. She has dark hair pulled back, dark eyes, and a serious expression.\n\n**Clothing:**\n*   She wears a white blouse with a bow at the collar.\n*   Over the blouse, she wears a black corset-like garment with straps that go over her shoulders.\n*   She wears a black pencil skirt with a slit.\n*   Large, dangling earrings\n\n**Setting:**\n*   The setting is a park or garden.\n*   There are trees, grass, and flowerbeds visible.\n*   In the background, there is a light-colored building with",
        "video_segment_id": 2,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_3.jpg",
        "transcript": "Here's a detailed description of the image:\n\n**Overall Impression:** The image appears to be a still from a video or film, possibly a fashion or commercial piece. It has a slightly retro or stylized aesthetic.\n\n**People:**\n*   A young woman is the central figure. She has dark hair pulled back, revealing a decorative ear cuff or earring.\n*   Her expression is confident and slightly upward-gazing.\n\n**Clothing:**\n*   She wears a green blazer with white pinstripes.\n*   Underneath the blazer, there's a white top with a bow or tie at the neck.\n\n**Objects:**\n*   A traffic light is positioned near the woman, with one light appearing to be lit green.\n*   There is a speaker attached to a pole, typical of urban environments.\n*   Buildings are visible in the background.\n\n**Colors:**\n*   The dominant colors are green, white, and neutral tones",
        "video_segment_id": 3,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_4.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**Overall Impression:** The image appears to be a still from a video or film, featuring a woman in a stylish outfit against an urban backdrop. The color palette is warm, with a slightly vintage feel due to the framing and color grading.\n\n**Objects:**\n*   **Traffic Light:** A traffic light is prominently positioned to the left of the woman, with green lights illuminated.\n*   **Building:** A large, multi-story building with classical architectural details, including rows of windows and a prominent cornice, is in the background.\n*   **Speakers:** There are speakers attached to the pole where the traffic light is.\n\n**People:**\n*   **Woman:** A woman with dark hair pulled back is the central figure. She is looking upwards and to the right of the frame. She is wearing an ear cuff on her left ear.\n\n**Text:**\n*   **\"nacida de esa manera",
        "video_segment_id": 4,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_5.jpg",
        "transcript": "Here is a detailed description of the visual elements in the image:\n\n**Overall Impression:**\nThe image has a vintage, somewhat dreamy aesthetic due to the color grading and possible film effects. It appears to be taken from a low angle, emphasizing the height and grandeur of the architecture.\n\n**Objects:**\n\n*   **Building:** A large, classical-style building is the primary architectural element. It features prominent pillars, a cornice, and what appears to be a dome in the background.\n*   **Columns:** Several large, classical-style columns are visible as part of the building's architecture.\n*   **Corner:** A corner of another building with a dome can be seen in the background.\n\n**People:**\n\n*   **Person:** A person is standing on a ledge or platform in front of the building. The person appears to be wearing a suit.\n\n**Colors:**\n\n*   **Dominant Color:** The image is heavily tinted with a warm, orange",
        "video_segment_id": 5,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_6.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**Overall Impression:** The image has a vintage or cinematic feel, possibly due to the color grading and aspect ratio. It features a woman in a stylish outfit posing against a backdrop of classical architecture.\n\n**Objects:**\n*   **Buildings:** A large building with classical architectural elements, including pillars, ornate details, and a substantial facade. The building appears to be made of stone or a similar material.\n*   **Clothing:** The woman is wearing a green and white striped suit that includes wide-leg pants and a jacket.\n*   **Pillars:** Several large, cylindrical pillars are visible, supporting the building's structure.\n\n**People:**\n*   **Woman:** A woman is standing prominently in the image. She has dark hair and is wearing a suit. Her posture is confident, suggesting a fashion-oriented or editorial context.\n\n**Colors:**\n*   **Dominant Colors:** The image",
        "video_segment_id": 6,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_7.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**Overall Impression:** The image has a vintage VHS aesthetic with overlaid text and a slightly distorted, yellowish-green color palette. It depicts two people, one appearing to be helping the other.\n\n**Objects:**\n*   **VHS Frame:** The image is framed within the rounded edges of a VHS tape screen.\n\n**People:**\n*   **Two Individuals:** There are two individuals visible in the image. The person in the background appears to be helping the person in the foreground.\n\n**Text:**\n*   **\"PLAY\"**: Located in the top left corner, accompanied by a right-facing triangle.\n*   **\"VideoSYS\"**: In the upper right corner.\n*   **Bottom Left**: \"06/11/1993\"\n*   **Bottom Right**: \"06/11/20:01\"\n\n**Colors:**\n*   **",
        "video_segment_id": 7,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_8.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:**\n\nThe image has a vintage, VHS-style aesthetic, likely created through post-processing effects. It features a woman posing outdoors in a slightly unconventional outfit against a backdrop of a building with classic architectural elements.\n\n**Objects:**\n\n*   **Clothing:** The woman is wearing a white, long-sleeved blouse with a large collar or bow. Over the blouse, she has on a black, studded, corset-like top. The lower part of her outfit appears to be a striped skirt or pants.\n*   **Accessories:** She is wearing large, dangling earrings.\n*   **Building:** In the background, there is a building with classical architectural details, including a roofline with decorative elements.\n*   **VHS Overlay Elements:** The image includes a \"PLAY\" symbol, a battery icon, and a timestamp (00:03:21:02),",
        "video_segment_id": 8,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_9.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**Overall Impression:** The image appears to be an abstract or distorted representation of a natural scene, possibly depicting trees or a waterfall. The colors are predominantly in a muted green and white palette.\n\n**Objects/Elements:**\n\n*   **Vertical Lines/Streaks:** The most prominent feature is the presence of numerous vertical lines or streaks that dominate the composition. These streaks vary in thickness and color intensity, ranging from light green to near-white.\n*   **Abstract Forms:** The streaks and lines create abstract shapes, making it difficult to identify specific objects.\n\n**Colors:**\n\n*   **Green:** Various shades of green, likely representing foliage or water. The greens are muted and desaturated.\n*   **White/Light Green:** Used to create highlights and contrast, suggesting light reflecting off surfaces.\n\n**Spatial Relationships:**\n\n*   **Vertical Orientation:** The composition is strongly vertical, with the lines and streaks",
        "video_segment_id": 9,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_10.jpg",
        "transcript": "Here's a description of the visual elements in the image:\n\n**Overall Impression:** The image appears to be a low-angle shot of a tree, possibly taken with a vintage camera or processed to have a retro aesthetic. The colors are muted, and the image has a slightly grainy or aged feel.\n\n**Objects:**\n*   **Tree:** The primary subject is a tree with many branches and green leaves. The tree is dense, filling much of the frame.\n*   **Sky:** A pale, overcast sky is visible in the background, peeking through the branches.\n\n**Colors:**\n*   **Green:** Various shades of green dominate the image due to the tree's foliage.\n*   **Light Gray/White:** The sky appears to be a light gray or white color, suggesting an overcast day.\n*   **Dark Brown/Black:** The tree trunk and thicker branches are dark brown or black.\n\n**Spatial Relationships:**\n*   The",
        "video_segment_id": 10,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_11.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:** The image has a slightly vintage or film-like quality due to the border and color grading. It features a woman in a stylish outfit set against an urban backdrop.\n\n**Main Subject:**\n*   **Woman:** A dark-haired woman is the central figure. Her hair is neatly pulled back. She is wearing large, statement earrings and a dark, possibly black, blazer or coat. She is looking over her shoulder towards the camera.\n\n**Setting & Background:**\n*   **Urban Landscape:** The background features a city square or plaza.\n*   **Buildings:** There are buildings with classical or European-style architecture. Some have multiple stories and rows of windows.\n*   **Monument/Statue:** A monument or statue is visible in the background.\n*   **Street Lights:** A street light with multiple arms extends upward.\n*   **Sky:** The sky appears",
        "video_segment_id": 11,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_12.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:**\nThe image has a low-angle perspective, looking upwards at a woman and a tall building. The color palette is muted, with a vintage or film-like aesthetic.\n\n**People:**\n\n*   **Woman:** A woman is positioned in the foreground. She has dark hair pulled back, visible makeup (possibly pink or purple eyeshadow and dark lipstick), and is wearing large, hoop earrings. She is wearing a light-colored garment, possibly a white blouse or jacket. Her hands are raised, seemingly behind her head.\n\n**Objects:**\n\n*   **Building:** A large, multi-story building dominates the background. The building is off-white or light beige in color and has architectural details such as cornices, windows with dark frames, and possibly a surveillance camera. The number \"858\" is visibly inscribed on the building.\n*   **Windows:** The building has",
        "video_segment_id": 12,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_13.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**Overall Impression:** The image has a vintage, possibly film-like aesthetic, indicated by the border and color grading. It features a woman posing in front of a building with classical architectural details.\n\n**Objects:**\n*   **Building:** A multi-story building with ornate architectural details such as moldings, window frames, and possibly a cornice. The building is painted in a light color, possibly beige or off-white. A number \"832\" is visible on the facade.\n*   **Windows:** Rectangular windows with dark frames are visible on the building.\n*   **Wall-mounted fixture:** A small, rectangular fixture attached to the building wall.\n*   **Clothing:** The woman wears a white, long-sleeved shirt with a tie. She also wears a black leather corset-like garment with straps and buckles.\n*   **Jewelry:** Dangle earrings are visible on the",
        "video_segment_id": 13,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_14.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:** The image has a slightly muted, urban fashion photography aesthetic. It seems to be captured in a real city environment with overcast lighting.\n\n**Subject:**\n*   **Person:** A woman with dark hair pulled back into a sleek style. She appears to be of mixed ethnicity. She has a serious expression.\n*   **Clothing:** She's wearing a white blouse with a large ruffled or bow detail at the front, a dark corset-like top with metallic accents, and a black overcoat. She also has dangling earrings.\n\n**Setting:**\n*   **Location:** An urban street scene, likely in a city with older European-style architecture.\n*   **Background:** Buildings with ornate facades, arched windows, and architectural details are visible in the background. There's a traffic light showing green, indicating a crosswalk.\n*   **Street:** The woman is standing",
        "video_segment_id": 14,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_15.jpg",
        "transcript": "Here is a detailed description of the visual elements in the image:\n\n**Overall Impression:**\nThe image appears to be a fashion shot, possibly from a photoshoot or a scene from a video. It features a woman in a stylish outfit posing on a large set of stairs in front of a building with classical architectural elements.\n\n**Objects:**\n*   **Stairs:** A wide, stone staircase dominates the foreground and middle ground.\n*   **Building:** A large building with classical features such as columns, pilasters, and an ornate pediment forms the background.\n*   **Doorway:** A large arched doorway or entrance is visible in the building's façade.\n*   **Security camera:** A security camera is visible on the building’s façade.\n\n**People:**\n*   **Woman:** A woman is the central subject of the image.\n\n**Clothing:**\n*   **Striped Suit:** She is wearing a green striped suit with a matching jacket and",
        "video_segment_id": 15,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_16.jpg",
        "transcript": "Here's a description of the visual elements in the image:\n\n**Overall Impression:** The image has a slightly vintage or film-like quality due to the border and color grading. It features a woman walking past a building with classical architectural details.\n\n**People:**\n\n*   There is one woman visible in the image.\n*   She has dark hair that appears slicked back and is styled in a low ponytail.\n*   She is wearing large, ornate earrings.\n*   She is wearing a dark (possibly black) top or coat.\n\n**Setting:**\n\n*   The setting appears to be an urban environment, possibly a city street.\n*   The background features a building with classical architectural elements, including:\n    *   Arched windows or doorways with decorative molding.\n    *   Columns or pilasters.\n    *   Ornate detailing on the facade.\n*   The building is a light color, possibly cream or beige.\n\n**Objects",
        "video_segment_id": 16,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_17.jpg",
        "transcript": "Here is a detailed description of the visual elements in the image:\n\n**Overall Impression:** The image has a vintage or cinematic feel due to the color grading and border. It features a woman in a stylish outfit posed in front of a European-style building.\n\n**Objects:**\n*   **Building:** A large, ornate building with multiple windows, balconies, and architectural details.\n*   **Clothing:** The woman wears a green pinstripe blazer, and a white blouse with a bow.\n*   **Jewelry:** She has decorative ear cuff on her left ear.\n\n**People:**\n*   **Woman:** The central figure is a woman with dark hair styled back, dark eyebrows, and dark lipstick. Her expression is serious and poised.\n\n**Colors:**\n*   **Green:** The blazer is a prominent shade of green with white pinstripes.\n*   **White:** The blouse is white.\n*   **Neutral Tones:** The building",
        "video_segment_id": 17,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_18.jpg",
        "transcript": "Here's a description of the visual elements in the image:\n\n**Overall Impression:** The image appears to be a close-up shot of a person, possibly a model, in a stylized setting, framed within a vintage-style film border.\n\n**Objects:**\n*   **Earcuffs:** The person is wearing elaborate, decorative earcuffs that cover a significant portion of their ear.\n*   **Clothing:** The person is wearing a green garment with white stripes.\n\n**People:**\n*   **Model:** The primary subject is a person with visible makeup, including dark lipstick and eye shadow.\n\n**Colors:**\n*   **Green:** A prominent color due to the clothing.\n*   **White:** Used for the stripes on the clothing.\n*   **Skin tones:** The person has a light to medium skin tone.\n*   **Dark red/Burgundy:** The person is wearing dark lipstick.\n\n**Spatial Relationships:**\n*   **",
        "video_segment_id": 18,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_19.jpg",
        "transcript": "Here's a breakdown of the visual elements in the image:\n\n*   **Objects:** There is a building in the background with multiple windows.\n*   **People:** A single person is visible, though their features are somewhat obscured by the overexposure.\n*   **Colors:** The dominant color is a very light blue or white.\n*   **Spatial Relationships:** The person is positioned in the foreground, with the building in the background.\n*   **Lighting:** The image is overexposed.\n*   **Composition:** The person is centered in the frame.\n*   **Setting:** The setting appears to be an urban environment, with a building in the background.\n*   **Activities:** The person seems to be posing, with one hand raised.\n*   **Clothing:** The person is wearing a light-colored shirt.\n*   **Background Details:** The background features a building with multiple windows. The image has a film-like frame around it",
        "video_segment_id": 19,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_20.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:** The image appears to be a fashion shot taken outdoors in an urban setting. A woman poses in the foreground, with a large building and street scene in the background. The color palette is somewhat muted, with a vintage film-like filter applied.\n\n**Objects:**\n*   A tall, dark pole (likely a street light or signpost) is positioned to the right of the woman, partially obscuring her.\n*   Several cars are visible on the street, including a white SUV.\n*   Traffic lights are present, indicating a street intersection.\n\n**People:**\n*   A young woman is the primary subject. She has dark hair pulled back, and a serious or neutral expression. She is making a gesture with her hand near her forehead, almost like a salute or visor.\n\n**Text:**\n*   The word \"BANCO\" is visible on the building's",
        "video_segment_id": 20,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_21.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**Overall Impression:** The image appears to be a fashion shot taken outdoors in an urban setting. The composition is striking, featuring a woman in a green striped suit leaning against a lamppost. The backdrop is a grand building with classical architectural elements.\n\n**Objects:**\n*   Lamppost: A dark-colored, ornate lamppost stands to the left.\n*   Building: A large, imposing building with classical architectural features like columns and detailed ornamentation.\n*   Doors: The building has large, ornate doors with metal bars.\n*   Windows: Windows are visible on the building, some with metal bars.\n\n**People:**\n*   Woman: A woman is the central figure, leaning casually against the lamppost.\n\n**Text:**\n*   \"BOLSA DE VALORES DE LIMA\" is inscribed above the doors of the building.\n\n**Colors:**\n*   Green:",
        "video_segment_id": 21,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_22.jpg",
        "transcript": "Here is a detailed description of the visual elements in the image:\n\n**Overall Impression:** The image appears to be a fashion shot taken in an urban setting. The model is the focal point, posing in an intersection with architectural buildings in the background. The lighting is somewhat muted, lending a slightly vintage feel.\n\n**Objects:**\n*   **Street:** The scene is set in a city street with crosswalk markings visible.\n*   **Traffic Light:** A traffic light pole is visible, indicating the intersection.\n*   **Buildings:** Ornate, multi-story buildings with architectural details such as windows, balconies, and cornices line the street.\n*   **Pole:** A dark-colored pole stands in the foreground, partially obscuring the view.\n*   **Vehicle:** A motorcycle is seen in the far background.\n\n**People:**\n*   **Model:** A woman is the primary subject. She has dark hair pulled back, and a serious expression.\n\n",
        "video_segment_id": 22,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_23.jpg",
        "transcript": "Here is a detailed description of the visual elements in the image:\n\n**Overall Impression:**\nThe image presents a stylish woman walking down a set of stairs in front of a grand, classical-style building. The scene has a slightly muted, vintage aesthetic.\n\n**People:**\n*   **Woman:** The main subject is a young woman with dark hair pulled back. She's wearing a green pinstripe suit and a white blouse. Her expression is neutral, and she appears to be walking confidently.\n\n**Clothing:**\n*   **Suit:** The woman is wearing a matching green pinstripe suit, consisting of a blazer draped over her shoulders and wide-legged pants.\n*   **Blouse:** She is wearing a white blouse underneath the blazer.\n*   **Shoes:** While not fully visible, it can be assumed she is wearing shoes that complement the outfit, likely heels or flats.\n\n**Setting:**\n*   **Building:** The background features a large",
        "video_segment_id": 23,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_24.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**Overall Impression:** The image features a woman walking down a grand set of stairs in front of a large, classical building with columns. The style has a slightly vintage or cinematic feel, possibly due to the coloring or framing.\n\n**People:**\n*   **Woman:** The main subject is a woman with dark hair pulled back. She is wearing a green pinstripe suit (blazer and pants) over a light-colored blouse. She is walking down the stairs and has one hand in her pocket. Her expression is neutral or slightly contemplative.\n\n**Objects:**\n*   **Suit:** The green suit with white pinstripes is a prominent element.\n*   **Blouse:** The woman is wearing a light-colored blouse underneath the suit.\n*   **Building:** A large classical building with tall columns is in the background.\n*   **Stairs:** A wide set of stone stairs leads",
        "video_segment_id": 24,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_25.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:** The image has a formal, perhaps slightly stylized, and possibly vintage feel. The composition emphasizes a sense of power and formality.\n\n**Objects:**\n\n*   **Building:** A large classical building with prominent columns. The building appears to be made of stone or a light-colored material.\n*   **Stairs:** Wide stone steps leading up to the building.\n*   **Columns:** Tall, classical columns are a dominant feature of the building's architecture.\n\n**People:**\n\n*   **Individual:** A person, likely female, is the primary subject. They have short dark hair.\n\n**Text:**\n\n*   A phrase in Spanish is present at the bottom of the image: \"La sociedad no va a cambiar al mundo\" (Society is not going to change the world).\n\n**Colors:**\n\n*   **Dominant colors:** Earth tones, shades of green,",
        "video_segment_id": 25,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_26.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**Overall Impression:** The image has a vintage or stylized aesthetic, possibly achieved through post-processing. It features a woman in business attire walking down the steps of a building with classical architecture. There is an orange-yellow light flare effect obscuring parts of the image.\n\n**Objects:**\n*   Building: A large, stone building with classical architectural elements, including columns.\n*   Stairs: The woman is walking down a set of stone stairs leading up to the building.\n\n**People:**\n*   Woman: A woman is the central figure, dressed in business-casual attire.\n\n**Colors:**\n*   Dominant colors: Beige, stone gray, and white.\n*   Light effects: Orange and yellow flares are present, which affect the overall color balance.\n\n**Spatial Relationships:**\n*   The woman is positioned in the foreground, descending the stairs.\n*   The building is in",
        "video_segment_id": 26,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_27.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:**\n\nThe image appears to be a still from a video or film, possibly a music video or short film. It has a slightly vintage or stylized aesthetic, with a soft color palette and a film-like border.\n\n**People:**\n\n*   **Woman:** The primary subject is a woman with dark hair pulled back, dark lipstick, and what appears to be a fair skin tone. She is wearing large, ornate chandelier-style earrings. Her eyes are closed. She is wearing a white collared shirt.\n\n**Objects:**\n\n*   **Earrings:** The woman is wearing large, chandelier-style earrings.\n*   **Building:** In the background, there is a large, light-colored building, possibly a church or governmental building, with arched windows.\n*   **Clothing:** The woman is wearing a white blouse with a bow. She appears to have a blue shoulder bag",
        "video_segment_id": 27,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_28.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**Overall Impression:** The image has a slightly aged, vintage or film-like quality, possibly due to the border and color grading. The focus is on a young woman in a formal setting.\n\n**People:**\n*   A young woman is the main subject. She has dark hair pulled back in a ponytail, visible dark eyebrows, and a serious or neutral expression. Her makeup includes dark lipstick.\n\n**Clothing & Accessories:**\n*   She wears a white blouse with puffy sleeves and what appears to be a bow or tie at the neck. A dark strap with metallic details is partially visible on her shoulder.\n*   She is wearing large, ornate, chandelier-style earrings that appear to be silver or crystal.\n\n**Setting:**\n*   The background seems to be an old building, possibly a historical site or palace, with visible windows and architectural details. The background is out of focus.\n\n**Colors:**",
        "video_segment_id": 28,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_29.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Composition:** The image is centered on a woman standing on a large set of stone steps in front of a grand, classical building. The composition emphasizes symmetry and a sense of scale.\n\n**Setting:** The setting is an outdoor location, specifically in front of a large, stately building that appears to be a library, museum, or courthouse. The architecture suggests a classical or Beaux-Arts style.\n\n**Building Details:**\n*   The building has a symmetrical facade with large columns.\n*   There are stone statues (possibly lions) on either side of the staircase.\n*   The entrance has large, ornate doors, possibly made of wood or metal, with a gold or bronze finish.\n*   The building is constructed of light-colored stone.\n\n**Person:**\n*   There is a woman standing on the steps, positioned in the center of the frame.\n*   She is wearing",
        "video_segment_id": 29,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_30.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:** The image captures a woman standing confidently on the steps of a grand, classical-style building. The composition emphasizes her presence and the architectural grandeur of the setting.\n\n**Objects:**\n\n*   **Building:** A large, imposing structure with classical architectural features. It has columns, a grand entrance with a golden door, and intricate detailing. The building appears to be made of stone or concrete.\n*   **Stairs:** Wide, stone steps leading up to the building's entrance. They are a prominent feature of the composition.\n*   **Door:** A large, golden door at the top of the stairs, serving as the entrance to the building.\n\n**People:**\n\n*   **Woman:** A woman stands on the middle of the stairs. She is wearing a green pinstripe suit with a white top underneath and black shoes.\n\n**Colors:**\n\n*   **Domin",
        "video_segment_id": 30,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_31.jpg",
        "transcript": "Here is a detailed description of the visual elements in the image:\n\n**Overall Impression:**\nThe image has a slightly vintage or cinematic feel due to the color grading and the border around the frame. It features a person standing in front of a large, ornate building, likely a government building or palace.\n\n**Objects:**\n*   **Building:** A large, light-colored building with multiple windows, columns, and decorative architectural details. There is a flag on top of the building.\n*   **Flag:** A flag is visible atop the building, though its specific colors and design are not clearly discernible.\n*   **Clothing:** The person is wearing a striped suit in shades of green and white, with a white shirt underneath.\n\n**People:**\n*   **Person:** A person is standing prominently in the foreground. Their expression is neutral or slightly serious.\n\n**Colors:**\n*   The predominant colors are light creams or off-whites for the building.\n*",
        "video_segment_id": 31,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_32.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Objects:**\n\n*   **Building:** A large, ornate building with classical architectural elements such as columns, windows, and detailed ornamentation. It appears to be a government building or palace-like structure. A flag is visible atop the building.\n*   **Clothing:** The woman is wearing a matching green and white striped suit consisting of a blazer and wide-legged trousers. She also wears a white blouse.\n\n**People:**\n\n*   **Woman:** A woman is standing in the foreground. She has dark hair and appears to be of medium complexion.\n\n**Colors:**\n\n*   **Dominant Colors:** Green, white, beige, and gray are the predominant colors.\n*   **Clothing:** The woman's suit is green and white striped.\n*   **Building:** The building is a light beige or off-white color.\n*   **Sky:** The sky is gray.\n\n",
        "video_segment_id": 32,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_33.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**Objects:**\n*   Buildings with ornate facades, arched doorways, and closed metal shutters.\n*   Sidewalk\n*   Street\n*   Street lights\n*   Large decorative earrings\n*   Belt\n\n**People:**\n\n*   A woman with dark hair pulled back, dark eyebrows, and dark lipstick.\n\n**Colors:**\n\n*   Dominant colors are white, gray, and black.\n*   The building facades are primarily white with gray accents.\n*   The woman's clothing consists of a white blouse, a black coat, and a black skirt with white dots.\n*   The sky is overcast or pale.\n\n**Spatial Relationships:**\n\n*   The woman is positioned in the foreground, standing on the sidewalk.\n*   The buildings form the background, appearing to stretch along the street.\n*   The camera angle is slightly tilted, creating a dynamic perspective.\n\n**Lighting",
        "video_segment_id": 33,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_34.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:** The image has a somewhat vintage or faded aesthetic, possibly due to a filter or the original source material. It features a young woman in a fashionable outfit standing in an urban setting with classical architecture.\n\n**People:**\n\n*   **Woman:** The primary subject is a young woman with dark hair pulled back. She has a serious or neutral expression. Her makeup includes defined eyebrows and dark lipstick.\n\n**Clothing:**\n\n*   She wears a white blouse with a large bow at the neck, a dark corset-like garment with what appears to be polka-dot pattern (potentially studs). Over the blouse she wears a dark coat or jacket.\n\n**Objects:**\n\n*   **Traffic Light:** A traffic light is visible on the left side of the frame. It is lit with green, indicating a walk signal.\n*   **Buildings:** Ornate, classical-style buildings form the backdrop.",
        "video_segment_id": 34,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_35.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**Overall Impression:** The image has a slightly vintage or retro feel, likely due to the color grading and framing. It seems to capture a moment of a stylish woman walking through a city.\n\n**Objects:**\n\n*   Buildings: Ornate, old architecture buildings with windows, pillars, and decorative elements are visible in the background.\n*   Street: A street surface, possibly wet, is visible in the foreground.\n*   Clothing: The woman wears a dark blazer, a white blouse with a bow, and a skirt with polka dots.\n*   Accessories: She is wearing earrings.\n\n**People:**\n\n*   Woman: A woman is the main subject of the image, positioned in the lower middle ground. She is walking and looking towards the left.\n\n**Text:**\n\n*   None\n\n**Colors:**\n\n*   Dominant colors: White, black, and grey.\n*   Color palette",
        "video_segment_id": 35,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_36.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**Overall Impression:** The image features a stylish woman in a formal outfit, posing outdoors against a backdrop of an older building. The shot is taken from a low angle, which makes the subject appear dominant and adds depth to the background.\n\n**People:**\n*   A single female model is the main subject. She has dark hair pulled back, dark eyebrows, and wears dark lipstick. She has an ear cuff on her left ear.\n\n**Clothing:**\n*   The woman is wearing a white blouse with a tied bow at the neck.\n*   Over the blouse, she has a green blazer with white pinstripes.\n\n**Setting:**\n*   The setting appears to be an urban environment, likely a city street.\n*   Behind the woman is a tall, classic-style building with many windows and architectural details. It has a light color, likely beige or white.\n*   A black",
        "video_segment_id": 36,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_37.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:**\nThe image features a stylishly dressed woman posing on the steps of a grand, classical building. The composition is carefully arranged to showcase her fashion and the impressive architecture.\n\n**People:**\n\n*   **Subject:** A woman with tan skin and dark hair is the focal point. She has a serious, confident expression.\n\n**Clothing:**\n\n*   **Suit:** She is wearing a green pinstripe suit. The blazer is draped over her shoulders, and the pants are visible as she sits.\n*   **Top:** Underneath the blazer, she wears a white blouse with a loose, flowing design.\n\n**Objects:**\n\n*   **Jewelry:** She is wearing earrings and at least one ring on her hand.\n*   **Building:** The background is dominated by a classical building with prominent columns, windows, and architectural details.\n*   **Steps:** She is",
        "video_segment_id": 37,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_38.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:**\n\nThe image has a slightly vintage, cinematic feel due to the border and color grading. The focus is on a woman posing in front of a classical building.\n\n**People:**\n\n*   **Woman:** The main subject is a woman with dark hair pulled back. She is wearing a white top and a green and white striped blazer. She has a neutral expression, looking slightly off-center. Her makeup is noticeable, particularly her dark lipstick.\n\n**Objects:**\n\n*   **Blazer:** A green blazer with white stripes is draped over her shoulders.\n*   **Building:** A large, classical building serves as the backdrop. It features arches, windows, and decorative elements.\n*   **Windows:** There are many windows visible on the building, some with closed curtains or blinds.\n*   **Arches:** The building has prominent arches, creating depth and visual interest.\n\n",
        "video_segment_id": 38,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_39.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:**\n\nThe image has a slightly vintage or stylized look, potentially due to the color grading or filter. It features a young woman in a modern outfit walking in front of a classical building. \n\n**People:**\n\n*   A young woman is the primary subject. She has dark hair styled back, and appears to be wearing an ear cuff or a similar piece of jewelry on her left ear. She has dark lipstick and is looking over her shoulder towards the viewer.\n\n**Clothing:**\n\n*   She is wearing a green blazer with white pinstripes. Underneath the blazer, she seems to be wearing a white top.\n\n**Setting:**\n\n*   The setting is an urban environment. The background features a grand, classical building with arched entryways, ornate window frames, and architectural details.\n*   A white van is partially visible on the left side of the frame, suggesting a",
        "video_segment_id": 39,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_40.jpg",
        "transcript": "Here's a breakdown of the visual elements in the image:\n\n**Overall Impression:** The image has a slightly vintage or faded look, possibly due to a filter or processing. It depicts a woman walking against the backdrop of an ornate, possibly historic building.\n\n**People:**\n\n*   **Woman:** A young woman is the primary subject. She is wearing a green striped blazer over a white top. Her dark hair is pulled back in a ponytail. She has an earbud in her left ear.\n\n**Objects:**\n\n*   **Blazer:** A teal/green blazer with vertical white stripes.\n*   **Top:** A white top under the blazer.\n*   **Earbud:** A small, white wireless earbud is visible in the woman's ear.\n*   **Building:** A large, ornate building with multiple windows, architectural details, and a light color (likely white or light gray).\n\n**Colors:**\n\n*   **Dominant Colors:**",
        "video_segment_id": 40,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_41.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**Overall Impression:** The image features a woman in a fashionable outfit standing in front of an ornate building. The shot is taken from a low angle, emphasizing the grandeur of the building and giving the woman a powerful presence. The image has a slightly vintage or film-like quality due to the border and color grading.\n\n**People:**\n\n*   **Woman:** A woman is the primary subject. She has dark hair pulled back, and her gaze is directed upwards and slightly to the side. She is wearing statement earrings. Her expression is neutral or slightly serious.\n\n**Objects:**\n\n*   **Building:** A large, ornate building with classical architectural details. It has multiple stories, visible windows, and decorative elements like cornices and pilasters. The facade appears to be made of light-colored stone or stucco.\n*   **Lighting Fixture:** A vintage-style lantern or light fixture is attached to the building,",
        "video_segment_id": 41,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_42.jpg",
        "transcript": "Here's a breakdown of the visual elements in the image:\n\n**Objects:**\n\n*   **Street Light:** A black, ornate street light is prominent in the foreground, slightly off-center. The model is leaning on it.\n*   **Traffic Light:** A traffic light with red showing is visible behind the model.\n*   **Buildings:** Tall, ornate buildings form the backdrop. These buildings appear to be old and made of stone or concrete, with architectural details like columns and arched windows.\n*   **Street:** A street is visible in the lower portion of the image.\n\n**People:**\n\n*   **Model:** A woman is the central figure. She has dark hair pulled back and is wearing a striking outfit. She appears to be posing.\n\n**Text:**\n\n*   There may be faint text on the buildings in the background, but it is not clearly legible.\n\n**Colors:**\n\n*   **Green:** The woman's suit is a",
        "video_segment_id": 42,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_43.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:**\n\nThe image appears to be a fashion shot or a still from a video. It has a slightly desaturated, vintage feel, possibly due to color grading. The focal point is a woman positioned in an urban setting with classic architectural details.\n\n**People:**\n\n*   **Woman:** The main subject is a woman with dark hair pulled back, highlighting her face. She has a neutral, slightly intense expression. She is wearing noticeable makeup, including dark lipstick and defined eyebrows.\n\n**Clothing & Accessories:**\n\n*   **White Blouse:** She is wearing a white blouse with a bow at the neck.\n*   **Harness:** She has a black leather harness or strap with silver studs across her shoulders.\n*   **Earrings:** She is wearing dangling, ornate earrings that appear to be made of silver and crystals.\n\n**Setting & Background:**\n\n*   **Urban Environment",
        "video_segment_id": 43,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_44.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**Overall Impression:** The image has a slightly vintage or film-like quality, suggested by the border and color grading. It features a woman posing in an outdoor setting.\n\n**People:**\n*   A young woman is the central figure.\n*   She has dark hair pulled back, dark eyes, and appears to have medium skin tone.\n*   Her makeup includes dark lipstick.\n*   She is wearing a large, possibly jeweled, ear cuff on one ear.\n*   She has one hand raised, partially obscuring her face. Her other hand rests at her neck.\n\n**Clothing:**\n*   She is wearing a white collared shirt with rolled-up sleeves.\n*   There is a glimpse of a green and white striped garment beneath the shirt.\n\n**Setting:**\n*   The background appears to be concrete steps or a structure made of similar material.\n*   The setting",
        "video_segment_id": 44,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_45.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**General:**\n\n*   **Color:** Black and white.\n*   **Framing:** The image is framed with a rounded black border, giving it a retro or vintage feel.\n*   **Composition:** The subject is centrally located and fills a significant portion of the frame.\n\n**Subject:**\n\n*   **Person:** A young adult woman.\n*   **Facial Features:** She has dark hair, defined eyebrows, and full lips. Her expression is somewhat serious or seductive.\n*   **Attire:** She is wearing a light-colored (likely white) long-sleeved shirt with visible buttons on the sleeve.\n*   **Jewelry:** She is wearing a decorative ear cuff or earring on her left ear. It appears to be adorned with small, light-colored embellishments, possibly pearls or beads.\n\n**Action/Pose:**\n\n*   **Position:** The woman is lying",
        "video_segment_id": 45,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_46.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:** The image appears to be a still from a video or film, possibly a music video or fashion shoot. It has a slightly vintage or stylized aesthetic, perhaps due to the color grading or the framing.\n\n**Objects:**\n*   **Building:** A large, ornate building with a classical architectural style dominates the background. It is likely a historical or governmental building. It features multiple windows, arched entrances, and decorative elements.\n*   **Car:** The top of a car is visible in the lower part of the image.\n*   **Trees:** There are small trees or shrubbery flanking the building.\n\n**People:**\n*   **Woman:** A woman is the primary subject of the image. She is positioned in the foreground.\n\n**Clothing:**\n*   **Woman's Outfit:** She is wearing a white, long-sleeved blouse with a bow at the neck.",
        "video_segment_id": 46,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_47.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:**\n\nThe image has a slightly vintage or film-like quality, possibly due to the color grading or the border effect around the edges. It features a woman posing in an urban setting with grand, old buildings in the background. The lighting is soft and overcast, creating a muted color palette.\n\n**People:**\n\n*   **Woman:** The primary subject is a woman with dark hair pulled back in a sleek style. She has a serious or neutral expression. She wears noticeable dangling earrings and dark lipstick.\n\n**Clothing:**\n\n*   The woman wears a striking outfit. It includes a white, possibly ruffled or layered blouse, combined with a dark corset or bodice. The lower part of her outfit appears to be striped fabric.\n\n**Setting:**\n\n*   **Urban Environment:** The background consists of classical-style buildings, likely located in a city. The architecture is characterized by white facades, windows",
        "video_segment_id": 47,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_48.jpg",
        "transcript": "Here is a detailed description of the visual elements in the image:\n\n**Overall Impression:** The image appears to be a portrait of a young woman standing in front of a large, ornate wooden door. The lighting is soft and diffused, creating a somewhat dreamy and elegant atmosphere.\n\n**People:**\n\n*   **Woman:** A young woman is the primary subject. She has dark hair pulled back into a low ponytail. Her skin tone is medium. She is wearing large, chandelier-style earrings. Her makeup includes dark lipstick. She appears to be in profile, with her eyes closed or looking downward. Her expression is serene or contemplative.\n\n**Clothing:**\n\n*   She is wearing a white blouse with a bow at the neckline. Over the blouse, she has a black harness or suspender-like garment with studs or embellishments.\n\n**Objects:**\n\n*   **Door:** A large, wooden door dominates the background. It appears to be an antique or a reproduction of an antique",
        "video_segment_id": 48,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_49.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Objects:**\n\n*   Building: A large, light-colored stone building with an arched doorway.\n*   Door: A large wooden door with decorative brass or gold-colored hardware.\n*   Lanterns: Two square lanterns mounted on either side of the doorway.\n\n**People:**\n\n*   Woman: A woman is positioned in the foreground, centered in the frame.\n\n**Text:**\n\n*   Building number: Faint text is visible above the arch on the building, likely a building number.\n\n**Colors:**\n\n*   Black: The woman's coat and corset are black.\n*   White: The woman's blouse is white.\n*   Brown: The building door is brown.\n*   Light Beige/Stone: The building's facade is a light beige or stone color.\n\n**Spatial Relationships:**\n\n*   The woman is standing in front of the",
        "video_segment_id": 49,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_50.jpg",
        "transcript": "Here is a detailed description of the visual elements in the image:\n\n**Overall Impression:** The image has a vintage or film-like quality due to its border and color grading. It features a woman in a stylish outfit against an urban backdrop.\n\n**People:**\n*   **Woman:** The primary subject is a woman with dark hair pulled back. She has a serious expression and wears dark lipstick. She is adorned with an ear cuff on her left ear.\n\n**Clothing:**\n*   **Green and White Striped Blazer:** The woman wears a green blazer with vertical white stripes.\n*   **White Blouse:** Underneath the blazer, she wears a white blouse with a bow at the neck.\n\n**Objects:**\n*   **Traffic Light:** A traffic light with red lights is prominently visible in the left side of the frame.\n*   **Ear Cuff:** The woman wears an ornate ear cuff.\n\n**Setting:**\n*   **Urban Environment:** The backdrop",
        "video_segment_id": 50,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_51.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:**\nThe image appears to be a fashion shot or a staged portrait. A woman in a stylish green suit is sitting on steps in front of a large, ornate building.\n\n**People:**\n*   **Woman:** The primary subject is a woman with dark hair and a serious expression. She is sitting casually on the steps. Her left hand is raised near her hair, and she is gazing directly at the viewer.\n\n**Clothing:**\n*   **Suit:** She is wearing a coordinated green suit with white vertical stripes. The suit consists of a blazer draped over her shoulders and matching trousers.\n*   **Shirt:** Underneath the blazer, she has on a white, long-sleeved shirt with a tie or bow detail at the neck.\n*   **Boots:** She is wearing black ankle boots.\n\n**Colors:**\n*   **Dominant Colors:** The primary colors",
        "video_segment_id": 51,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_52.jpg",
        "transcript": "Here is a detailed description of the visual elements in the image:\n\n**Overall Impression:**\nThe image shows a woman crossing a street in what appears to be a European or South American city. The scene has a slightly desaturated color palette, giving it a vintage or cinematic feel.\n\n**Objects:**\n*   **Buildings:** Two large, ornate buildings flank the street. They are light in color, possibly white or cream, with classical architectural details like arches, columns, and multiple windows.\n*   **Street:** The street is asphalt, marked with white pedestrian crosswalk stripes and directional arrows.\n*   **Crosswalk:** Clearly visible with white stripes.\n*   **Clothing:** The woman is wearing a long, dark coat, a light-colored top (possibly white), and short, black high-heeled boots.\n\n**People:**\n*   **Woman:** A single woman is the main subject, crossing the street. She has dark hair pulled back, visible",
        "video_segment_id": 52,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_53.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:** The image has a formal and stylish aesthetic. The subject is a woman in professional attire, posed in front of a grand, classical building. The color palette is muted, with a focus on greens, whites, and beige tones.\n\n**Objects:**\n\n*   **Building:** A large, classical building with columns, arches, and detailed architectural features. It appears to be made of stone or concrete.\n*   **Clothing:** The woman is wearing a green pinstripe suit (jacket and pants) and a white blouse with a tie at the neck.\n\n**People:**\n\n*   **Woman:** A woman with dark hair, light skin, and a serious expression. She is the central subject of the image.\n\n**Colors:**\n\n*   **Green:** The suit is a prominent shade of green, with white pinstripes.\n*   **White:** The blouse is",
        "video_segment_id": 53,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_54.jpg",
        "transcript": "Here is a detailed description of the visual elements in the image:\n\n**Overall Composition and Setting:**\n\n*   The image appears to be a fashion shot or promotional still taken in an urban setting.\n*   The scene is a city street with a large, ornate building in the background.\n*   The lighting is somewhat overcast, creating a slightly muted color palette.\n*   The image has a vintage or film-like quality, possibly due to a border or post-processing effects.\n\n**Foreground Elements:**\n\n*   **Person:** A woman is the primary subject. She is walking across a crosswalk.\n*   **Clothing:** She is wearing a coordinated green pinstripe suit with wide-legged pants and a matching blazer. Underneath, she has on a white top. She is wearing black high-heeled boots.\n*   **Action:** She appears to be confidently striding across the street.\n*   **Cars:** Cars are visible in the",
        "video_segment_id": 54,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_55.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:**\n\nThe image presents a woman in a formal outfit, standing in front of a classical building. The composition is centered on her, conveying a sense of confidence and authority.\n\n**People:**\n\n*   A woman is the primary subject. She appears to be of South Asian descent. She has dark hair pulled back, dark eyes, and pronounced cheekbones. She's wearing dark lipstick.\n\n**Clothing:**\n\n*   She wears a white blouse with a bow at the neck.\n*   Over the blouse, she sports a green blazer with thin white vertical stripes.\n*   She is wearing large, ornate earrings that appear to be made of crystals or a similar reflective material.\n\n**Setting:**\n\n*   The background is a classical building with large columns and a pediment. The building appears to be made of light-colored stone.\n*   The location suggests a government building",
        "video_segment_id": 55,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_56.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**Objects:**\n*   Large classical-style building with columns, statues, and intricate architectural details\n*   Stone steps or platform in the foreground\n*   Statue of a lion on top of the building\n\n**People:**\n*   A person dressed in a green pinstripe suit\n\n**Colors:**\n*   Primary colors are shades of grey, beige, and green\n*   The building appears to be made of beige or light-colored stone\n*   The person's suit is green with pinstripes\n\n**Spatial Relationships:**\n*   The person is standing on a stone platform or steps in front of the building.\n*   The building is large and imposing, looming over the person.\n*   The lion statue is positioned at the top of the building, to the right.\n\n**Lighting:**\n*   The lighting appears to be soft and somewhat overcast, possibly from an",
        "video_segment_id": 56,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_57.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**Overall Impression:**\nThe image appears to be a fashion shot or a still from a film/video, featuring a woman in a stylish outfit posing in front of a grand, classical-style building.\n\n**Objects:**\n*   **Building:** A large, imposing building with classical architectural elements. It has columns, decorative carvings, and a multi-tiered facade. The material seems to be stone or concrete.\n*   **Clothing:** The woman is wearing a green striped suit with wide-legged pants and a matching blazer. Underneath, she has on a white top.\n*   **Platform:** The woman is standing on a stone platform or ledge that is part of the building's architecture.\n*   **Security Camera:** A small, round security camera is visible attached to the wall of the building.\n*   **Statues:** There appear to be statues or decorative elements at the top of the",
        "video_segment_id": 57,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_58.jpg",
        "transcript": "Here is a description of the visual elements in the image:\n\n**Objects:**\n\n*   **Architecture:** The image prominently features a large, classical-style building with columns, ornate details, and stone construction. The building has windows and doors.\n*   **Clothing:** A woman is wearing a green striped suit.\n*   **Text:** The name \"STEPHANIE URIBE\" is displayed in white letters.\n\n**People:**\n\n*   **Woman:** A woman is standing on a ledge in front of the building. She has dark hair and is wearing a green striped suit with a white shirt underneath.\n*   **Person in Window:** A person is seen in a window of the building.\n\n**Colors:**\n\n*   **Green:** The woman's suit is green with white stripes.\n*   **White:** The building and the woman's shirt are white.\n*   **Brown/Beige:** The building has brown/beige tones",
        "video_segment_id": 58,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    },
    {
        "extracted_frame_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\extracted_frames\\frame_59.jpg",
        "transcript": "Here's a detailed description of the visual elements in the image:\n\n**Overall Impression:**\n\nThe image appears to be a still from a video or film, possibly a title card or scene from a fashion-related project. It has a slightly aged or stylized aesthetic, possibly achieved through color grading or post-processing.\n\n**Objects:**\n\n*   **Buildings:** The primary background consists of large, classical-style buildings. These buildings feature columns, ornate detailing (moldings, cornices), and what appears to be stone or concrete construction.\n*   **Steps/Platform:** In the foreground, there are stone or concrete steps leading up to a platform where the person stands.\n*   **Door:** A door with a decorative gate is visible on the left side of the building.\n\n**People:**\n\n*   **Woman:** A woman is the central figure in the image. She has dark hair and is wearing a white top and a striped teal suit. She stands confidently",
        "video_segment_id": 59,
        "video_path": "C:\\Users\\Raj244639\\Documents\\VideoChat\\cohere-test\\shared_data\\videos\\video5\\Bmpcc 6k - Fashion Film II Stephanie Uribe.mp4"
    }
]